analogdevicesinc/msdk/Libraries/RF-PHY/MAX32665/include/dbb_ctrl_regs.h
/**@} end of group DBB_CTRL_TX_CTRL_CMD_Register */

/**
 * @ingroup  dbb_ctrl_registers
 * @defgroup DBB_CTRL_RX_CTRL_CMD DBB_CTRL_RX_CTRL_CMD
 * @brief    cmd
 * @{
 */
#define MXC_F_DBB_CTRL_RX_CTRL_CMD_ENABLE_POS          0 /**< RX_CTRL_CMD_ENABLE Position */
#define MXC_F_DBB_CTRL_RX_CTRL_CMD_ENABLE              ((uint32_t)(0x1UL << MXC_F_DBB_CTRL_RX_CTRL_CMD_ENABLE_POS)) /**< RX_CTRL_CMD_ENABLE Mask */

#define MXC_F_DBB_CTRL_RX_CTRL_CMD_DISABLE_POS         1 /**< RX_CTRL_CMD_DISABLE Position */
#define MXC_F_DBB_CTRL_RX_CTRL_CMD_DISABLE             ((uint32_t)(0x1UL << MXC_F_DBB_CTRL_RX_CTRL_CMD_DISABLE_POS)) /**< RX_CTRL_CMD_DISABLE Mask */

#define MXC_F_DBB_CTRL_RX_CTRL_CMD_STOP_POS            2 /**< RX_CTRL_CMD_STOP Position */
#define MXC_F_DBB_CTRL_RX_CTRL_CMD_STOP                ((uint32_t)(0x1UL << MXC_F_DBB_CTRL_RX_CTRL_CMD_STOP_POS)) /**< RX_CTRL_CMD_STOP Mask */

/**@} end of group DBB_CTRL_RX_CTRL_CMD_Register */

/**
 * @ingroup  dbb_ctrl_registers
 * @defgroup DBB_CTRL_TX_PMU_WAKE_UP_DLY DBB_CTRL_TX_PMU_WAKE_UP_DLY
 * @brief    wake_up_dly
 * @{
 */
#define MXC_F_DBB_CTRL_TX_PMU_WAKE_UP_DLY_STAB_POS     0 /**< TX_PMU_WAKE_UP_DLY_STAB Position */
#define MXC_F_DBB_CTRL_TX_PMU_WAKE_UP_DLY_STAB         ((uint16_t)(0x3FUL << MXC_F_DBB_CTRL_TX_PMU_WAKE_UP_DLY_STAB_POS)) /**< TX_PMU_WAKE_UP_DLY_STAB Mask */

#define MXC_F_DBB_CTRL_TX_PMU_WAKE_UP_DLY_UNUSED_POS   6 /**< TX_PMU_WAKE_UP_DLY_UNUSED Position */
#define MXC_F_DBB_CTRL_TX_PMU_WAKE_UP_DLY_UNUSED       ((uint16_t)(0x3UL << MXC_F_DBB_CTRL_TX_PMU_WAKE_UP_DLY_UNUSED_POS)) /**< TX_PMU_WAKE_UP_DLY_UNUSED Mask */

#define MXC_F_DBB_CTRL_TX_PMU_WAKE_UP_DLY_ISO_POS      8 /**< TX_PMU_WAKE_UP_DLY_ISO Position */
#define MXC_F_DBB_CTRL_TX_PMU_WAKE_UP_DLY_ISO          ((uint16_t)(0x3FUL << MXC_F_DBB_CTRL_TX_PMU_WAKE_UP_DLY_ISO_POS)) /**< TX_PMU_WAKE_UP_DLY_ISO Mask */

/**@} end of group DBB_CTRL_TX_PMU_WAKE_UP_DLY_Register */

/**
 * @ingroup  dbb_ctrl_registers
 * @defgroup DBB_CTRL_TX_PMU_CTRL DBB_CTRL_TX_PMU_CTRL
 * @brief    ctrl
 * @{
 */
#define MXC_F_DBB_CTRL_TX_PMU_CTRL_PWR_GATING_ON_POS   0 /**< TX_PMU_CTRL_PWR_GATING_ON Position */
#define MXC_F_DBB_CTRL_TX_PMU_CTRL_PWR_GATING_ON       ((uint16_t)(0x1UL << MXC_F_DBB_CTRL_TX_PMU_CTRL_PWR_GATING_ON_POS)) /**< TX_PMU_CTRL_PWR_GATING_ON Mask */

#define MXC_F_DBB_CTRL_TX_PMU_CTRL_WAKEUP_POS          1 /**< TX_PMU_CTRL_WAKEUP Position */
#define MXC_F_DBB_CTRL_TX_PMU_CTRL_WAKEUP              ((uint16_t)(0x1UL << MXC_F_DBB_CTRL_TX_PMU_CTRL_WAKEUP_POS)) /**< TX_PMU_CTRL_WAKEUP Mask */

#define MXC_F_DBB_CTRL_TX_PMU_CTRL_SLEEP_POS           2 /**< TX_PMU_CTRL_SLEEP Position */
#define MXC_F_DBB_CTRL_TX_PMU_CTRL_SLEEP               ((uint16_t)(0x1UL << MXC_F_DBB_CTRL_TX_PMU_CTRL_SLEEP_POS)) /**< TX_PMU_CTRL_SLEEP Mask */

/**@} end of group DBB_CTRL_TX_PMU_CTRL_Register */

/**
 * @ingroup  dbb_ctrl_registers
 * @defgroup DBB_CTRL_RFFE_PMU_WAKE_UP_DLY DBB_CTRL_RFFE_PMU_WAKE_UP_DLY
 * @brief    wake_up_dly
 * @{
 */
#define MXC_F_DBB_CTRL_RFFE_PMU_WAKE_UP_DLY_STAB_POS   0 /**< RFFE_PMU_WAKE_UP_DLY_STAB Position */
#define MXC_F_DBB_CTRL_RFFE_PMU_WAKE_UP_DLY_STAB       ((uint16_t)(0x3FUL << MXC_F_DBB_CTRL_RFFE_PMU_WAKE_UP_DLY_STAB_POS)) /**< RFFE_PMU_WAKE_UP_DLY_STAB Mask */

#define MXC_F_DBB_CTRL_RFFE_PMU_WAKE_UP_DLY_UNUSED_POS 6 /**< RFFE_PMU_WAKE_UP_DLY_UNUSED Position */
#define MXC_F_DBB_CTRL_RFFE_PMU_WAKE_UP_DLY_UNUSED     ((uint16_t)(0x3UL << MXC_F_DBB_CTRL_RFFE_PMU_WAKE_UP_DLY_UNUSED_POS)) /**< RFFE_PMU_WAKE_UP_DLY_UNUSED Mask */

#define MXC_F_DBB_CTRL_RFFE_PMU_WAKE_UP_DLY_ISO_POS    8 /**< RFFE_PMU_WAKE_UP_DLY_ISO Position */
#define MXC_F_DBB_CTRL_RFFE_PMU_WAKE_UP_DLY_ISO        ((uint16_t)(0x3FUL << MXC_F_DBB_CTRL_RFFE_PMU_WAKE_UP_DLY_ISO_POS)) /**< RFFE_PMU_WAKE_UP_DLY_ISO Mask */

/**@} end of group DBB_CTRL_RFFE_PMU_WAKE_UP_DLY_Register */

/**
 * @ingroup  dbb_ctrl_registers
 * @defgroup DBB_CTRL_RFFE_PMU_CTRL DBB_CTRL_RFFE_PMU_CTRL
 * @brief    ctrl
 * @{
 */
#define MXC_F_DBB_CTRL_RFFE_PMU_CTRL_PWR_GATING_ON_POS 0 /**< RFFE_PMU_CTRL_PWR_GATING_ON Position */
#define MXC_F_DBB_CTRL_RFFE_PMU_CTRL_PWR_GATING_ON     ((uint16_t)(0x1UL << MXC_F_DBB_CTRL_RFFE_PMU_CTRL_PWR_GATING_ON_POS)) /**< RFFE_PMU_CTRL_PWR_GATING_ON Mask */

#define MXC_F_DBB_CTRL_RFFE_PMU_CTRL_WAKEUP_POS        1 /**< RFFE_PMU_CTRL_WAKEUP Position */
#define MXC_F_DBB_CTRL_RFFE_PMU_CTRL_WAKEUP            ((uint16_t)(0x1UL << MXC_F_DBB_CTRL_RFFE_PMU_CTRL_WAKEUP_POS)) /**< RFFE_PMU_CTRL_WAKEUP Mask */

#define MXC_F_DBB_CTRL_RFFE_PMU_CTRL_SLEEP_POS         2 /**< RFFE_PMU_CTRL_SLEEP Position */
#define MXC_F_DBB_CTRL_RFFE_PMU_CTRL_SLEEP             ((uint16_t)(0x1UL << MXC_F_DBB_CTRL_RFFE_PMU_CTRL_SLEEP_POS)) /**< RFFE_PMU_CTRL_SLEEP Mask */

/**@} end of group DBB_CTRL_RFFE_PMU_CTRL_Register */

/**
 * @ingroup  dbb_ctrl_registers
 * @defgroup DBB_CTRL_RX_PMU_WAKE_UP_DLY DBB_CTRL_RX_PMU_WAKE_UP_DLY
 * @brief    wake_up_dly
 * @{
 */
#define MXC_F_DBB_CTRL_RX_PMU_WAKE_UP_DLY_STAB_POS     0 /**< RX_PMU_WAKE_UP_DLY_STAB Position */
#define MXC_F_DBB_CTRL_RX_PMU_WAKE_UP_DLY_STAB         ((uint16_t)(0x3FUL << MXC_F_DBB_CTRL_RX_PMU_WAKE_UP_DLY_STAB_POS)) /**< RX_PMU_WAKE_UP_DLY_STAB Mask */

#define MXC_F_DBB_CTRL_RX_PMU_WAKE_UP_DLY_UNUSED_POS   6 /**< RX_PMU_WAKE_UP_DLY_UNUSED Position */
#define MXC_F_DBB_CTRL_RX_PMU_WAKE_UP_DLY_UNUSED       ((uint16_t)(0x3UL << MXC_F_DBB_CTRL_RX_PMU_WAKE_UP_DLY_UNUSED_POS)) /**< RX_PMU_WAKE_UP_DLY_UNUSED Mask */

#define MXC_F_DBB_CTRL_RX_PMU_WAKE_UP_DLY_ISO_POS      8 /**< RX_PMU_WAKE_UP_DLY_ISO Position */
#define MXC_F_DBB_CTRL_RX_PMU_WAKE_UP_DLY_ISO          ((uint16_t)(0x3FUL << MXC_F_DBB_CTRL_RX_PMU_WAKE_UP_DLY_ISO_POS)) /**< RX_PMU_WAKE_UP_DLY_ISO Mask */

/**@} end of group DBB_CTRL_RX_PMU_WAKE_UP_DLY_Register */

/**
 * @ingroup  dbb_ctrl_registers
 * @defgroup DBB_CTRL_RX_PMU_CTRL DBB_CTRL_RX_PMU_CTRL
 * @brief    ctrl
 * @{
 */
#define MXC_F_DBB_CTRL_RX_PMU_CTRL_PWR_GATING_ON_POS   0 /**< RX_PMU_CTRL_PWR_GATING_ON Position */
#define MXC_F_DBB_CTRL_RX_PMU_CTRL_PWR_GATING_ON       ((uint16_t)(0x1UL << MXC_F_DBB_CTRL_RX_PMU_CTRL_PWR_GATING_ON_POS)) /**< RX_PMU_CTRL_PWR_GATING_ON Mask */

#define MXC_F_DBB_CTRL_RX_PMU_CTRL_WAKEUP_POS          1 /**< RX_PMU_CTRL_WAKEUP Position */
#define MXC_F_DBB_CTRL_RX_PMU_CTRL_WAKEUP              ((uint16_t)(0x1UL << MXC_F_DBB_CTRL_RX_PMU_CTRL_WAKEUP_POS)) /**< RX_PMU_CTRL_WAKEUP Mask */

#define MXC_F_DBB_CTRL_RX_PMU_CTRL_SLEEP_POS           2 /**< RX_PMU_CTRL_SLEEP Position */
#define MXC_F_DBB_CTRL_RX_PMU_CTRL_SLEEP               ((uint16_t)(0x1UL << MXC_F_DBB_CTRL_RX_PMU_CTRL_SLEEP_POS)) /**< RX_PMU_CTRL_SLEEP Mask */

/**@} end of group DBB_CTRL_RX_PMU_CTRL_Register */

/**
 * @ingroup  dbb_ctrl_registers
 * @defgroup DBB_CTRL_GEN_PMU_STATUS DBB_CTRL_GEN_PMU_STATUS
 * @brief    status
 * @{
 */
#define MXC_F_DBB_CTRL_GEN_PMU_STATUS_TX_POS           0 /**< GEN_PMU_STATUS_TX Position */
#define MXC_F_DBB_CTRL_GEN_PMU_STATUS_TX               ((uint32_t)(0x1UL << MXC_F_DBB_CTRL_GEN_PMU_STATUS_TX_POS)) /**< GEN_PMU_STATUS_TX Mask */

