analogdevicesinc/msdk/Libraries/RF-PHY/MAX32665/include/dbb_ctrl_regs.h
#define MXC_F_DBB_CTRL_GEN_PMU_STATUS_RFE_POS          1 /**< GEN_PMU_STATUS_RFE Position */
#define MXC_F_DBB_CTRL_GEN_PMU_STATUS_RFE              ((uint32_t)(0x1UL << MXC_F_DBB_CTRL_GEN_PMU_STATUS_RFE_POS)) /**< GEN_PMU_STATUS_RFE Mask */

#define MXC_F_DBB_CTRL_GEN_PMU_STATUS_RX_POS           2 /**< GEN_PMU_STATUS_RX Position */
#define MXC_F_DBB_CTRL_GEN_PMU_STATUS_RX               ((uint32_t)(0x1UL << MXC_F_DBB_CTRL_GEN_PMU_STATUS_RX_POS)) /**< GEN_PMU_STATUS_RX Mask */

/**@} end of group DBB_CTRL_GEN_PMU_STATUS_Register */

/**
 * @ingroup  dbb_ctrl_registers
 * @defgroup DBB_CTRL_EVENT_TIMING_CTRL DBB_CTRL_EVENT_TIMING_CTRL
 * @brief    ctrl
 * @{
 */
#define MXC_F_DBB_CTRL_EVENT_TIMING_CTRL_ENABLE_POS    0 /**< EVENT_TIMING_CTRL_ENABLE Position */
#define MXC_F_DBB_CTRL_EVENT_TIMING_CTRL_ENABLE        ((uint32_t)(0x1UL << MXC_F_DBB_CTRL_EVENT_TIMING_CTRL_ENABLE_POS)) /**< EVENT_TIMING_CTRL_ENABLE Mask */

#define MXC_F_DBB_CTRL_EVENT_TIMING_CTRL_RST_POS       1 /**< EVENT_TIMING_CTRL_RST Position */
#define MXC_F_DBB_CTRL_EVENT_TIMING_CTRL_RST           ((uint32_t)(0x1UL << MXC_F_DBB_CTRL_EVENT_TIMING_CTRL_RST_POS)) /**< EVENT_TIMING_CTRL_RST Mask */

#define MXC_F_DBB_CTRL_EVENT_TIMING_CTRL_SET_TX_ENABLE_TIME_POS 2 /**< EVENT_TIMING_CTRL_SET_TX_ENABLE_TIME Position */
#define MXC_F_DBB_CTRL_EVENT_TIMING_CTRL_SET_TX_ENABLE_TIME ((uint32_t)(0x1UL << MXC_F_DBB_CTRL_EVENT_TIMING_CTRL_SET_TX_ENABLE_TIME_POS)) /**< EVENT_TIMING_CTRL_SET_TX_ENABLE_TIME Mask */

#define MXC_F_DBB_CTRL_EVENT_TIMING_CTRL_SET_RX_ENABLE_TIME_POS 3 /**< EVENT_TIMING_CTRL_SET_RX_ENABLE_TIME Position */
#define MXC_F_DBB_CTRL_EVENT_TIMING_CTRL_SET_RX_ENABLE_TIME ((uint32_t)(0x1UL << MXC_F_DBB_CTRL_EVENT_TIMING_CTRL_SET_RX_ENABLE_TIME_POS)) /**< EVENT_TIMING_CTRL_SET_RX_ENABLE_TIME Mask */

#define MXC_F_DBB_CTRL_EVENT_TIMING_CTRL_SET_GP_EVENT_TIME_POS 4 /**< EVENT_TIMING_CTRL_SET_GP_EVENT_TIME Position */
#define MXC_F_DBB_CTRL_EVENT_TIMING_CTRL_SET_GP_EVENT_TIME ((uint32_t)(0x1UL << MXC_F_DBB_CTRL_EVENT_TIMING_CTRL_SET_GP_EVENT_TIME_POS)) /**< EVENT_TIMING_CTRL_SET_GP_EVENT_TIME Mask */

#define MXC_F_DBB_CTRL_EVENT_TIMING_CTRL_STOP_TX_ENABLE_EVENT_POS 5 /**< EVENT_TIMING_CTRL_STOP_TX_ENABLE_EVENT Position */
#define MXC_F_DBB_CTRL_EVENT_TIMING_CTRL_STOP_TX_ENABLE_EVENT ((uint32_t)(0x1UL << MXC_F_DBB_CTRL_EVENT_TIMING_CTRL_STOP_TX_ENABLE_EVENT_POS)) /**< EVENT_TIMING_CTRL_STOP_TX_ENABLE_EVENT Mask */

#define MXC_F_DBB_CTRL_EVENT_TIMING_CTRL_STOP_RX_ENABLE_EVENT_POS 6 /**< EVENT_TIMING_CTRL_STOP_RX_ENABLE_EVENT Position */
#define MXC_F_DBB_CTRL_EVENT_TIMING_CTRL_STOP_RX_ENABLE_EVENT ((uint32_t)(0x1UL << MXC_F_DBB_CTRL_EVENT_TIMING_CTRL_STOP_RX_ENABLE_EVENT_POS)) /**< EVENT_TIMING_CTRL_STOP_RX_ENABLE_EVENT Mask */

#define MXC_F_DBB_CTRL_EVENT_TIMING_CTRL_STOP_GP_EVENT_POS 7 /**< EVENT_TIMING_CTRL_STOP_GP_EVENT Position */
#define MXC_F_DBB_CTRL_EVENT_TIMING_CTRL_STOP_GP_EVENT ((uint32_t)(0x1UL << MXC_F_DBB_CTRL_EVENT_TIMING_CTRL_STOP_GP_EVENT_POS)) /**< EVENT_TIMING_CTRL_STOP_GP_EVENT Mask */

/**@} end of group DBB_CTRL_EVENT_TIMING_CTRL_Register */

/**
 * @ingroup  dbb_ctrl_registers
 * @defgroup DBB_CTRL_EVENTS_STATUS DBB_CTRL_EVENTS_STATUS
 * @brief    status
 * @{
 */
#define MXC_F_DBB_CTRL_EVENTS_STATUS_TX_DONE_POS       0 /**< EVENTS_STATUS_TX_DONE Position */
#define MXC_F_DBB_CTRL_EVENTS_STATUS_TX_DONE           ((uint16_t)(0x1UL << MXC_F_DBB_CTRL_EVENTS_STATUS_TX_DONE_POS)) /**< EVENTS_STATUS_TX_DONE Mask */

#define MXC_F_DBB_CTRL_EVENTS_STATUS_RX_RECEIVED_POS   1 /**< EVENTS_STATUS_RX_RECEIVED Position */
#define MXC_F_DBB_CTRL_EVENTS_STATUS_RX_RECEIVED       ((uint16_t)(0x1UL << MXC_F_DBB_CTRL_EVENTS_STATUS_RX_RECEIVED_POS)) /**< EVENTS_STATUS_RX_RECEIVED Mask */

#define MXC_F_DBB_CTRL_EVENTS_STATUS_RX_ENERGY_DET_POS 2 /**< EVENTS_STATUS_RX_ENERGY_DET Position */
#define MXC_F_DBB_CTRL_EVENTS_STATUS_RX_ENERGY_DET     ((uint16_t)(0x1UL << MXC_F_DBB_CTRL_EVENTS_STATUS_RX_ENERGY_DET_POS)) /**< EVENTS_STATUS_RX_ENERGY_DET Mask */

#define MXC_F_DBB_CTRL_EVENTS_STATUS_RX_SFD_DET_POS    3 /**< EVENTS_STATUS_RX_SFD_DET Position */
#define MXC_F_DBB_CTRL_EVENTS_STATUS_RX_SFD_DET        ((uint16_t)(0x1UL << MXC_F_DBB_CTRL_EVENTS_STATUS_RX_SFD_DET_POS)) /**< EVENTS_STATUS_RX_SFD_DET Mask */

#define MXC_F_DBB_CTRL_EVENTS_STATUS_RX_SFD_TO_POS     4 /**< EVENTS_STATUS_RX_SFD_TO Position */
#define MXC_F_DBB_CTRL_EVENTS_STATUS_RX_SFD_TO         ((uint16_t)(0x1UL << MXC_F_DBB_CTRL_EVENTS_STATUS_RX_SFD_TO_POS)) /**< EVENTS_STATUS_RX_SFD_TO Mask */

#define MXC_F_DBB_CTRL_EVENTS_STATUS_RFE_SPIM_RDY_POS  5 /**< EVENTS_STATUS_RFE_SPIM_RDY Position */
#define MXC_F_DBB_CTRL_EVENTS_STATUS_RFE_SPIM_RDY      ((uint16_t)(0x1UL << MXC_F_DBB_CTRL_EVENTS_STATUS_RFE_SPIM_RDY_POS)) /**< EVENTS_STATUS_RFE_SPIM_RDY Mask */

#define MXC_F_DBB_CTRL_EVENTS_STATUS_INVALID_ADDR_POS  6 /**< EVENTS_STATUS_INVALID_ADDR Position */
#define MXC_F_DBB_CTRL_EVENTS_STATUS_INVALID_ADDR      ((uint16_t)(0x1UL << MXC_F_DBB_CTRL_EVENTS_STATUS_INVALID_ADDR_POS)) /**< EVENTS_STATUS_INVALID_ADDR Mask */

#define MXC_F_DBB_CTRL_EVENTS_STATUS_GP_EVENT_POS      7 /**< EVENTS_STATUS_GP_EVENT Position */
#define MXC_F_DBB_CTRL_EVENTS_STATUS_GP_EVENT          ((uint16_t)(0x1UL << MXC_F_DBB_CTRL_EVENTS_STATUS_GP_EVENT_POS)) /**< EVENTS_STATUS_GP_EVENT Mask */

#define MXC_F_DBB_CTRL_EVENTS_STATUS_TX_AES_DONE_POS   8 /**< EVENTS_STATUS_TX_AES_DONE Position */
#define MXC_F_DBB_CTRL_EVENTS_STATUS_TX_AES_DONE       ((uint16_t)(0x1UL << MXC_F_DBB_CTRL_EVENTS_STATUS_TX_AES_DONE_POS)) /**< EVENTS_STATUS_TX_AES_DONE Mask */

#define MXC_F_DBB_CTRL_EVENTS_STATUS_RX_AES_DONE_POS   9 /**< EVENTS_STATUS_RX_AES_DONE Position */
#define MXC_F_DBB_CTRL_EVENTS_STATUS_RX_AES_DONE       ((uint16_t)(0x1UL << MXC_F_DBB_CTRL_EVENTS_STATUS_RX_AES_DONE_POS)) /**< EVENTS_STATUS_RX_AES_DONE Mask */

#define MXC_F_DBB_CTRL_EVENTS_STATUS_DECRYPT_FAIL_POS  10 /**< EVENTS_STATUS_DECRYPT_FAIL Position */
#define MXC_F_DBB_CTRL_EVENTS_STATUS_DECRYPT_FAIL      ((uint16_t)(0x1UL << MXC_F_DBB_CTRL_EVENTS_STATUS_DECRYPT_FAIL_POS)) /**< EVENTS_STATUS_DECRYPT_FAIL Mask */

