analogdevicesinc/msdk/Libraries/RF-PHY/MAX32665/include/dbb_ctrl_regs.h
#define MXC_F_DBB_CTRL_EVENTS_STATUS_RX_SFD2_DE_POS    11 /**< EVENTS_STATUS_RX_SFD2_DE Position */
#define MXC_F_DBB_CTRL_EVENTS_STATUS_RX_SFD2_DE        ((uint16_t)(0x1UL << MXC_F_DBB_CTRL_EVENTS_STATUS_RX_SFD2_DE_POS)) /**< EVENTS_STATUS_RX_SFD2_DE Mask */

/**@} end of group DBB_CTRL_EVENTS_STATUS_Register */

/**
 * @ingroup  dbb_ctrl_registers
 * @defgroup DBB_CTRL_EVENTS_IRQ_TEST DBB_CTRL_EVENTS_IRQ_TEST
 * @brief    irq_test
 * @{
 */
#define MXC_F_DBB_CTRL_EVENTS_IRQ_TEST_TX_DONE_POS     0 /**< EVENTS_IRQ_TEST_TX_DONE Position */
#define MXC_F_DBB_CTRL_EVENTS_IRQ_TEST_TX_DONE         ((uint16_t)(0x1UL << MXC_F_DBB_CTRL_EVENTS_IRQ_TEST_TX_DONE_POS)) /**< EVENTS_IRQ_TEST_TX_DONE Mask */

#define MXC_F_DBB_CTRL_EVENTS_IRQ_TEST_RX_RECEIVED_POS 1 /**< EVENTS_IRQ_TEST_RX_RECEIVED Position */
#define MXC_F_DBB_CTRL_EVENTS_IRQ_TEST_RX_RECEIVED     ((uint16_t)(0x1UL << MXC_F_DBB_CTRL_EVENTS_IRQ_TEST_RX_RECEIVED_POS)) /**< EVENTS_IRQ_TEST_RX_RECEIVED Mask */

#define MXC_F_DBB_CTRL_EVENTS_IRQ_TEST_RX_ENERGY_DET_POS 2 /**< EVENTS_IRQ_TEST_RX_ENERGY_DET Position */
#define MXC_F_DBB_CTRL_EVENTS_IRQ_TEST_RX_ENERGY_DET   ((uint16_t)(0x1UL << MXC_F_DBB_CTRL_EVENTS_IRQ_TEST_RX_ENERGY_DET_POS)) /**< EVENTS_IRQ_TEST_RX_ENERGY_DET Mask */

#define MXC_F_DBB_CTRL_EVENTS_IRQ_TEST_RX_SFD_DET_POS  3 /**< EVENTS_IRQ_TEST_RX_SFD_DET Position */
#define MXC_F_DBB_CTRL_EVENTS_IRQ_TEST_RX_SFD_DET      ((uint16_t)(0x1UL << MXC_F_DBB_CTRL_EVENTS_IRQ_TEST_RX_SFD_DET_POS)) /**< EVENTS_IRQ_TEST_RX_SFD_DET Mask */

#define MXC_F_DBB_CTRL_EVENTS_IRQ_TEST_RX_SFD_TO_POS   4 /**< EVENTS_IRQ_TEST_RX_SFD_TO Position */
#define MXC_F_DBB_CTRL_EVENTS_IRQ_TEST_RX_SFD_TO       ((uint16_t)(0x1UL << MXC_F_DBB_CTRL_EVENTS_IRQ_TEST_RX_SFD_TO_POS)) /**< EVENTS_IRQ_TEST_RX_SFD_TO Mask */

#define MXC_F_DBB_CTRL_EVENTS_IRQ_TEST_RFE_SPIM_RDY_POS 5 /**< EVENTS_IRQ_TEST_RFE_SPIM_RDY Position */
#define MXC_F_DBB_CTRL_EVENTS_IRQ_TEST_RFE_SPIM_RDY    ((uint16_t)(0x1UL << MXC_F_DBB_CTRL_EVENTS_IRQ_TEST_RFE_SPIM_RDY_POS)) /**< EVENTS_IRQ_TEST_RFE_SPIM_RDY Mask */

#define MXC_F_DBB_CTRL_EVENTS_IRQ_TEST_INVALID_ADDR_POS 6 /**< EVENTS_IRQ_TEST_INVALID_ADDR Position */
#define MXC_F_DBB_CTRL_EVENTS_IRQ_TEST_INVALID_ADDR    ((uint16_t)(0x1UL << MXC_F_DBB_CTRL_EVENTS_IRQ_TEST_INVALID_ADDR_POS)) /**< EVENTS_IRQ_TEST_INVALID_ADDR Mask */

#define MXC_F_DBB_CTRL_EVENTS_IRQ_TEST_GP_EVENT_POS    7 /**< EVENTS_IRQ_TEST_GP_EVENT Position */
#define MXC_F_DBB_CTRL_EVENTS_IRQ_TEST_GP_EVENT        ((uint16_t)(0x1UL << MXC_F_DBB_CTRL_EVENTS_IRQ_TEST_GP_EVENT_POS)) /**< EVENTS_IRQ_TEST_GP_EVENT Mask */

#define MXC_F_DBB_CTRL_EVENTS_IRQ_TEST_TX_AES_DONE_POS 8 /**< EVENTS_IRQ_TEST_TX_AES_DONE Position */
#define MXC_F_DBB_CTRL_EVENTS_IRQ_TEST_TX_AES_DONE     ((uint16_t)(0x1UL << MXC_F_DBB_CTRL_EVENTS_IRQ_TEST_TX_AES_DONE_POS)) /**< EVENTS_IRQ_TEST_TX_AES_DONE Mask */

#define MXC_F_DBB_CTRL_EVENTS_IRQ_TEST_RX_AES_DONE_POS 9 /**< EVENTS_IRQ_TEST_RX_AES_DONE Position */
#define MXC_F_DBB_CTRL_EVENTS_IRQ_TEST_RX_AES_DONE     ((uint16_t)(0x1UL << MXC_F_DBB_CTRL_EVENTS_IRQ_TEST_RX_AES_DONE_POS)) /**< EVENTS_IRQ_TEST_RX_AES_DONE Mask */

#define MXC_F_DBB_CTRL_EVENTS_IRQ_TEST_DECRYPT_FAIL_POS 10 /**< EVENTS_IRQ_TEST_DECRYPT_FAIL Position */
#define MXC_F_DBB_CTRL_EVENTS_IRQ_TEST_DECRYPT_FAIL    ((uint16_t)(0x1UL << MXC_F_DBB_CTRL_EVENTS_IRQ_TEST_DECRYPT_FAIL_POS)) /**< EVENTS_IRQ_TEST_DECRYPT_FAIL Mask */

#define MXC_F_DBB_CTRL_EVENTS_IRQ_TEST_RX_SFD2_DE_POS  11 /**< EVENTS_IRQ_TEST_RX_SFD2_DE Position */
#define MXC_F_DBB_CTRL_EVENTS_IRQ_TEST_RX_SFD2_DE      ((uint16_t)(0x1UL << MXC_F_DBB_CTRL_EVENTS_IRQ_TEST_RX_SFD2_DE_POS)) /**< EVENTS_IRQ_TEST_RX_SFD2_DE Mask */

/**@} end of group DBB_CTRL_EVENTS_IRQ_TEST_Register */

#ifdef __cplusplus
}
#endif

#endif // MAX32665_INCLUDE_DBB_CTRL_REGS_H_
